# FSActLayer

## Description
Function FSActLayer returns a handle to the first selected object on the active layer. If no objects are selected, the function returns NIL.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION FSActLayer : HANDLE;
```

```python

def vs.FSActLayer():
    return HANDLE
```

## Version
Availability: from MiniCAD
## Category
* Document List Handling